let questions = [
    {
        "question": "在團體中，凡事最好以我為主？",
        "answers": [
            ["是的", 2],
            ["不是,我習慣低調", 6]
        ]
    },
    {
        "question": "假使有人勉強送你一樣你並不喜歡的東西，你會？",
        "answers": [
            ["人家都送來了，不要白不要", 3],
            ["心裡不悅，卻也不好說些什麼", 4]
        ]
    },
    {
        "question": "每回做好一件事時，你最在意的是？",
        "answers": [
            ["別人的掌聲", "A"],
            ["自己得到的滿足感", 4]
        ]
    },
    {
        "question": "能作好一件事，你認為最需要感謝的人是？",
        "answers": [
            ["自己，要不是自己這麼厲害，哪能辦得到", "A"],
            ["其他伙伴，有大家的配合，才有完美的結果", 5]
        ]
    },
    {
        "question": "身體健康與容貌比較起來，你比較在乎？",
        "answers": [
            ["身體健康", "E"],
            ["容貌", "F"]
        ]
    },
    {
        "question": "團隊榮譽與個人成敗比較起來，你在乎的是",
        "answers": [
            ["團隊榮譽", 7],
            ["個人成敗", 8]
        ]
    },
    {
        "question": "要你去指揮其他人，你會覺得？",
        "answers": [
            ["還好，並不困難", 8],
            ["那就算了吧", "C"]
        ]
    },
    {
        "question": "動腦與分析這兩項，你比較擅長",
        "answers": [
            ["動腦", 9],
            ["分析", "G"]
        ]
    },
    {
        "question": "對於『吃苦當作吃補』這句話，你的意見是？",
        "answers": [
            ["這就是我至今的生存之道吧", "B"],
            ["別傻了，會用腦筋的人才不隨便吃苦", "D"]
        ]
    }
];

let finalAnswers = {
    "A": ["你是投手", "必備特質：好的控球力｜致勝武器，強烈的自信心，體力充沛、謹慎配球（先發必備）， 神經大條，隨傳隨到（後援必備）。", "防禦守則：不是你死就是我活之必勝決心。"],
    "B": ["你是捕手", "必備特質：身材魁梧，耐力十足，異於常人的頭腦，最好是天才，靈敏的反應。", "防禦守則：分身有術，身如銅牆鐵壁，手如鐵砂無敵。"],
    "C": ["你是一壘手", "必備特質：接得準，捕得好，身材高大，最好會劈腿，慣用左手。", "防禦守則：一壘手與跑者的速度對決就在劈腿的瞬間決定勝負。"],
    "D": ["你是二壘手", "必備特質：優異的接球技巧，身手敏捷，移動迅速，智慧異於常人。", "防禦守則：眼觀四方，耳聽八方，聰明一時，守備一世。"],
    "E": ["你是三壘手", "必備特質：過人的勇氣，好的臂力，集經驗與智慧於一身的速度爆發力。", "防禦守則：往前跑，往後退，擋得了球就擋得住分數。"],
    "F": ["你是游擊手", "必備特質：優異的接捕技巧，強力的肩膀，移動迅速的快腿，敏銳的頭腦。", "防禦守則：靜觀其變，動如脫兔，接殺於無形之間。"],
    "G": ["你是外野手", "必備特質：左外野能接，中外野能跑，右外野能傳，迅速作出判斷。", "防禦守則：天外飛來一球，比天上掉下來的禮物更加珍貴。"]
};

//source: https://github.com/ryan403/love-taste-quiz/blob/master/data.js